Layer (type)                 Output Shape              Param #   
=================================================================
conv1_1 (Conv2D)             (None, 30, 62, 24)        1824      
_________________________________________________________________
batch_normalization_1 (Batch (None, 30, 62, 24)        96        
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 62, 24)        0         
_________________________________________________________________
conv2_1 (Conv2D)             (None, 13, 29, 36)        21636     
_________________________________________________________________
batch_normalization_2 (Batch (None, 13, 29, 36)        144       
_________________________________________________________________
dropout_2 (Dropout)          (None, 13, 29, 36)        0         
_________________________________________________________________
conv3_1 (Conv2D)             (None, 5, 13, 48)         43248     
_________________________________________________________________
batch_normalization_3 (Batch (None, 5, 13, 48)         192       
_________________________________________________________________
dropout_3 (Dropout)          (None, 5, 13, 48)         0         
_________________________________________________________________
conv4_1 (Conv2D)             (None, 3, 11, 64)         27712     
_________________________________________________________________
batch_normalization_4 (Batch (None, 3, 11, 64)         256       
_________________________________________________________________
dropout_4 (Dropout)          (None, 3, 11, 64)         0         
_________________________________________________________________
conv4_2 (Conv2D)             (None, 1, 9, 64)          36928     
_________________________________________________________________
batch_normalization_5 (Batch (None, 1, 9, 64)          256       
_________________________________________________________________
dropout_5 (Dropout)          (None, 1, 9, 64)          0         
_________________________________________________________________
time_distributed_1 (TimeDist (None, 1, 576)            0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 1, 64)             164096    
_________________________________________________________________
lstm_2 (LSTM)                (None, 1, 64)             33024     
_________________________________________________________________
lstm_3 (LSTM)                (None, 1, 64)             33024     
_________________________________________________________________
dense_1 (Dense)              (None, 1, 200)            13000     
_________________________________________________________________
dropout_6 (Dropout)          (None, 1, 200)            0         
_________________________________________________________________
dense_2 (Dense)              (None, 1, 100)            20100     
_________________________________________________________________
dropout_7 (Dropout)          (None, 1, 100)            0         
_________________________________________________________________
dense_3 (Dense)              (None, 1, 50)             5050      
_________________________________________________________________
dropout_8 (Dropout)          (None, 1, 50)             0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 50)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 51        
=================================================================
Total params: 400,637
Trainable params: 400,165
Non-trainable params: 472
_________________________________________________________________
